Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge Class
 The AnalysisEdge class contains information related to analysis edges.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisEdge
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisEdge : AnalysisObject
Public NotInheritable Class AnalysisEdge
	Inherits AnalysisObject
The AnalysisEdge type exposes the following members.
Constructors
Name | Description
AnalysisEdge
 Creates a new instance of the AnalysisEdge class.
Top
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
Connectivity
 The connectivity of the analysis edge.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
Radius
 The radius of the analysis edge.
SplitPositions
 The split positions of the analysis edge.
Top
Methods
Name | Description
AddSplit
 Adds a split position to the analysis edge.
CopyData
 Copies data from another analysis edge.
GetSplitPositions
 Gets the split positions of the analysis edge.
Modify
 Modifies an analysis edge. The AnalysisModelName has to be set.
Select
 Selects an analysis edge.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace